[  
  {  
     "id":1001,
     "title":"Creamy courgette lasagne",
     "description":"Serve up this creamy quick dish for a last minute dinner party and impress veggie friends.",
     "vegetarian":true,
     "vegan":false,
     "glutenFree":false,
     "dairyFree":false,
     "servings":4,
     "sourceUrl":"https://www.bbcgoodfood.com/recipes/4716/creamy-courgette-lasagne",
     "likes":430,
     "readyInMinutes":30,
     "image":"1001.jpg",
     "ingredients":[  
        "9 dried lasagne sheets",
        "1 tbsp sunflower oil",
        "1 onion, finely chopped",
        "1/4 cup clam juice",
        "700g courgette (about 6), coarsely grated",
        "2 garlic cloves, crushed",
        "250g tub ricotta",
        "50g cheddar",
        "350g jar tomato sauce for pasta"
     ],
     "instructions":[  
        "Heat oven to 220C/fan 200C/gas 7. Put a pan of water on to boil, then cook the lasagne sheets for about 5 mins until softened, but not cooked through. Rinse in cold water, then drizzle with a little oil to stop them sticking together.",
        "Meanwhile, heat the oil in a large frying pan, then fry the onion. After 3 mins, add the courgettes and garlic and continue to fry until the courgette has softened and turned bright green. Stir in 2/3 of both the ricotta and the cheddar, then season to taste. Heat the tomato sauce in the microwave for 2 mins on High until hot.",
        "In a large baking dish, layer up the lasagne, starting with half the courgette mix, then pasta, then tomato sauce. Repeat, top with blobs of the remaining ricotta, then scatter with the rest of the cheddar. Bake on the top shelf for about 10 mins until the pasta is tender and the cheese is golden."
     ]
  },
  {  
     "id":1002,
     "title":"Hearty pasta soup",
     "description":"Do something different with a pack of tortellini. This filling soup is full of fibre, low fat and full of veg. The perfect lunch or supper.",
     "vegetarian":true,
     "vegan":false,
     "glutenFree":false,
     "dairyFree":false,
     "servings":4,
     "sourceUrl":"https://www.bbcgoodfood.com/recipes/5592/hearty-pasta-soup",
     "likes":287,
     "readyInMinutes":30,
     "image":"1002.jpg",
     "ingredients":[  
        "1 tbsp olive oil",
        "2 carrots, chopped",
        "1 large onion, finely chopped",
        "1l vegetable stock",
        "400g can chopped tomato",
        "200g frozen mixed pea and beans",
        "250g pack fresh filled tortellini (we used spinach and ricotta)",
        "handful of basil leaves (optional)",
        "grated parmesan (or vegetarian alternative), to serve"
     ],
     "instructions":[  
        "Heat oil in a pan. Fry the carrots and onion for 5 mins until starting to soften. Add the stock and tomatoes, then simmer for 10 mins. Add the peas and beans with 5 mins to go.",
        "Once veg is tender, stir in the pasta. Return to the boil and simmer for 2 mins until the pasta is just cooked. Stir in the basil, if using. Season, then serve in bowls topped with a sprinkling of Parmesan and slices of garlic bread."
     ]
  },
  {  
     "id":1003,
     "title":"Ultimate spaghetti carbonara recipe",
     "description":"Discover how to make superb spaghetti carbonara. This cheesy pasta dish is an Italian favourite and with the right technique, you can make it perfect every time.",
     "vegetarian":false,
     "vegan":false,
     "glutenFree":false,
     "dairyFree":false,
     "servings":4,
     "sourceUrl":"https://www.bbcgoodfood.com/recipes/1052/ultimate-spaghetti-carbonara",
     "likes":217,
     "readyInMinutes":30,
     "image":"1003.jpg",
     "ingredients":[  
        "100g pancetta",
        "50g pecorino cheese",
        "50g parmesan",
        "3 large eggs",
        "350g spaghetti",
        "2 plump garlic cloves, peeled and left whole",
        "50g unsalted butter",
        "sea salt and freshly grated black pepper"
     ],
     "instructions":[  
        "Put a large saucepan of water on to boil.",
        "Finely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.",
        "Beat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.",
        "Add 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).",
        "Squash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.",
        "While the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.",
        "Leave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.",
        "Keep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.",
        "Mix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.",
        "Take the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.",
        "Add extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.",
        "Use a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived."
     ]
  },
  {  
     "id":1004,
     "title":"Italian broccoli & salmon bake",
     "description":"Take a fresh look at broccoli with this creamy pasta bake.",
     "vegetarian":false,
     "vegan":false,
     "glutenFree":false,
     "dairyFree":false,
     "servings":4,
     "sourceUrl":"https://www.bbcgoodfood.com/recipes/1398/italian-broccoli-and-salmon-bake",
     "likes":218,
     "readyInMinutes":55,
     "image":"1004.jpg",
     "ingredients":[  
        "250g penne",
        "300g broccoli, cut into large florets",
        "25g butter",
        "25g plain flour",
        "600ml milk",
        "100g mascarpone",
        "8 sundried tomatoes (preserved in olive oil), drained and thickly sliced",
        "2 tbsp small capers (optional) rinsed to remove excess salt or vinegar",
        "8 anchovy fillets, halved (optional)",
        "10 large fresh basil leaves, roughly torn",
        "4 fresh skinless salmon fillets",
        "50g mature cheddar, finely grated"
     ],
     "instructions":[  
        "Preheat the oven to 190C/gas 5/fan 170C and get out an ovenproof dish (measuring 20 by 30cm, and about 5cm deep). Meanwhile, put a large pan of water on to boil for the pasta. When it is boiling rapidly, tip in the pasta with a generous sprinkling of salt. Give it a stir, return to the boil and cook for 6 minutes. Add the broccoli, then return the water to the boil and cook for 4 minutes more, until the broccoli is on the firm side of just tender. Drain well.",
        "Heat oil in a large saucepan over medium heat. Add thyme, red pepper, anchovies, and garlic; cook 2 minutes.",
        "While the pasta is cooking, put the butter, flour and milk in a large pan and heat, whisking or stirring continuously, until it thickens to make a smooth sauce. Remove from the heat and stir in the mascarpone, sun-dried tomatoes, capers (if using), anchovies (if using) and basil, then add the pasta and broccoli and season well.",
        "Halve the salmon fillets widthways (you will see that there is an obvious divide on each fillet) then place the pieces in a single layer on the base of the ovenproof dish. Spoon the broccoli mixture on top, then scatter with the grated cheddar. (You can chill this for up to 4 hours if you want to get ahead.)",
        "Bake for 30 minutes until the mixture is just starting to bubble round the edges and the mixture is pale golden – don’t let it go too dark or the fish will overcook."
     ]
  }
]